# Actividad M2.1 Uso de Google Colab

Joaquín Bravo García A00830409

**HOLA JOAQUIN, SOY EDER**

In [ ]:
import pandas as pd

## Lectura de datos

Prepara Google Colab para acceder a datos en Google Drive (mount)

Guarda en un dataframe el contenido del dataset proporcionado.

Verifica que el archivo cargado en Google Colab corresponde con el archivo csv, mostrando  los primeros y los últimos renglones del "data frame" y 
comparándolos con los datos correspondientes en el archivo CSV.

In [ ]:
from google.colab import drive
import pandas as pd
drive.mount('/content/gdrive')

Drive already mounted at /content/gdrive; to attempt to forcibly remount, call drive.mount("/content/gdrive", force_remount=True).

In [ ]:
cd "/content/gdrive/My Drive/TC2004B"

/content/gdrive/My Drive/TC2004B

In [ ]:

mis_datos = pd.read_csv("titanic.csv")
mis_datos.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
mis_datos.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

## Descripción de variables

In [ ]:
mis_datos.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

**Variables numéricas:** PassengerId, Survived, Pclass, Age, SibSp, Parch, Fare

**Variables categóricas:** Name, Sex, Ticket, Cabin, Embarked

In [ ]:
var_num = ['PassengerId', 'Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare']
var_cat = ['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked']
print(var_num)
var_cat

['PassengerId', 'Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare']

['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked']

In [ ]:
mis_datos.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [ ]:
mis_datos.describe()
# Esta función te da un resumen estadístico descriptivo del data frame, tal como el promedio, los cuartiles, etc.

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [ ]:
mis_datos.info()
# Esta función te da un resumen de las columnas, los datos que hay en cada una de estos, cuántos valores nulos hay y el tipo de cada
# una de las columnas

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [ ]:
mis_datos.size
# Hay 10692 registros en la base de datos

10692

In [ ]:
missing_values_count=mis_datos.isnull().sum()
print(missing_values_count)
total_missing = missing_values_count.sum()
print('\nHay un total de: ',total_missing,' valores nulos')
# Hay 866 valores nulos

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

Hay un total de:  866  valores nulos

En describe() aparecen las siguientes columnas: PassengerId	Survived	Pclass	Age	SibSp	Parch	Fare

In [ ]:
mis_datos.Fare.max()
# La tarifa más cara es de 512.329200

512.3292

In [ ]:
mis_datos.Age.mean()
#El promedio de edad es de 29.699118

29.69911764705882

In [ ]:
var_cat

['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked']

In [ ]:
# Valores únicos de nombres
name = mis_datos['Name']
name = name.unique()
len(name)

891

In [ ]:
# valores únicos de 'Sex'
sex = mis_datos['Sex']
sex = sex.unique()
len(sex)

2

In [ ]:
# valores únicos de 'Ticket'
ticket = mis_datos['Ticket']
ticket = ticket.unique()
len(ticket)

681

In [ ]:
# valores únicos de 'Cabin'
cabin = mis_datos['Cabin']
cabin = cabin.unique()
len(cabin)

148

In [ ]:
# valores únicos de 'Embarked'
Embarked = mis_datos['Embarked']
Embarked = Embarked.unique()
len(Embarked)

4

## Análisis de datos

In [ ]:
mis_datos['Fare'].sum()

28693.9493

In [ ]:
survived = mis_datos[mis_datos['Survived'] == 1]
survived.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [ ]:
died = mis_datos[mis_datos['Survived'] == 0]
died.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S

![colab.png]()